TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_unicommuart.h
/* UNICOMMUART_LCRH Bits */
/* UNICOMMUART_LCRH[BRK] Bits */
#define UNICOMMUART_LCRH_BRK_OFS                 (0)                             /* !< BRK Offset */
#define UNICOMMUART_LCRH_BRK_MASK                ((uint32_t)0x00000001U)         /* !< UART Send Break (for LIN Protocol)
                                                                                    1. Break condition is sent on the
                                                                                    line for as long as this bit is set */
#define UNICOMMUART_LCRH_BRK_DISABLE             ((uint32_t)0x00000000U)         /* !< Normal operation */
#define UNICOMMUART_LCRH_BRK_ENABLE              ((uint32_t)0x00000001U)         /* !< A low level is continually output
                                                                                    on the UARTxTXD signal, after
                                                                                    completing transmission of the
                                                                                    current character. For the proper
                                                                                    execution of the break command,
                                                                                    software must set this bit for at
                                                                                    least two frames (character periods). */
/* UNICOMMUART_LCRH[PEN] Bits */
#define UNICOMMUART_LCRH_PEN_OFS                 (1)                             /* !< PEN Offset */
#define UNICOMMUART_LCRH_PEN_MASK                ((uint32_t)0x00000002U)         /* !< UART Parity Enable */
#define UNICOMMUART_LCRH_PEN_DISABLE             ((uint32_t)0x00000000U)         /* !< Parity is disabled and no parity
                                                                                    bit is added to the data frame. */
#define UNICOMMUART_LCRH_PEN_ENABLE              ((uint32_t)0x00000002U)         /* !< Parity checking and generation is
                                                                                    enabled. */
/* UNICOMMUART_LCRH[EPS] Bits */
#define UNICOMMUART_LCRH_EPS_OFS                 (2)                             /* !< EPS Offset */
#define UNICOMMUART_LCRH_EPS_MASK                ((uint32_t)0x00000004U)         /* !< UART Even Parity Select  This bit
                                                                                    has no effect when parity is disabled
                                                                                    by the PEN bit.  For 9-Bit UART Mode
                                                                                    transmissions, this bit controls the
                                                                                    address byte and data byte indication
                                                                                    (9th bit). 0 = The transferred byte
                                                                                    is a data byte 1 = The transferred
                                                                                    byte is an address byte */
#define UNICOMMUART_LCRH_EPS_ODD                 ((uint32_t)0x00000000U)         /* !< Odd parity is performed, which
                                                                                    checks for an odd number of 1s. */
#define UNICOMMUART_LCRH_EPS_EVEN                ((uint32_t)0x00000004U)         /* !< Even parity generation and checking
                                                                                    is performed during transmission and
                                                                                    reception, which checks for an even
                                                                                    number of 1s in data and parity bits. */
/* UNICOMMUART_LCRH[STP2] Bits */
#define UNICOMMUART_LCRH_STP2_OFS                (3)                             /* !< STP2 Offset */
#define UNICOMMUART_LCRH_STP2_MASK               ((uint32_t)0x00000008U)         /* !< UART Two Stop Bits Select     When
                                                                                    in 7816 smart card mode (the SMART
                                                                                    bit is set in the UARTCTL register),
                                                                                    the number of stop bits is forced to
                                                                                    2. */
#define UNICOMMUART_LCRH_STP2_DISABLE            ((uint32_t)0x00000000U)         /* !< One stop bit is transmitted at the
                                                                                    end of a frame. */
#define UNICOMMUART_LCRH_STP2_ENABLE             ((uint32_t)0x00000008U)         /* !< Two stop bits are transmitted at
                                                                                    the end of a frame. The receive logic
                                                                                    checks for two stop bits being
                                                                                    received and provide Frame Error if
                                                                                    either is invalid. */
/* UNICOMMUART_LCRH[WLEN] Bits */
#define UNICOMMUART_LCRH_WLEN_OFS                (4)                             /* !< WLEN Offset */
#define UNICOMMUART_LCRH_WLEN_MASK               ((uint32_t)0x00000030U)         /* !< UART Word Length  The bits indicate
                                                                                    the number of data bits transmitted
                                                                                    or received in a frame as follows: */
#define UNICOMMUART_LCRH_WLEN_DATABIT5           ((uint32_t)0x00000000U)         /* !< 5 bits (default) */
#define UNICOMMUART_LCRH_WLEN_DATABIT6           ((uint32_t)0x00000010U)         /* !< 6 bits */
#define UNICOMMUART_LCRH_WLEN_DATABIT7           ((uint32_t)0x00000020U)         /* !< 7 bits */
#define UNICOMMUART_LCRH_WLEN_DATABIT8           ((uint32_t)0x00000030U)         /* !< 8 bits */
/* UNICOMMUART_LCRH[SPS] Bits */
#define UNICOMMUART_LCRH_SPS_OFS                 (6)                             /* !< SPS Offset */
#define UNICOMMUART_LCRH_SPS_MASK                ((uint32_t)0x00000040U)         /* !< UART Stick Parity Select The Stick
                                                                                    Parity Select (SPS) bit is used to
                                                                                    set either a permanent '1' or a
                                                                                    permanent '0' as parity when
                                                                                    transmitting or receiving data. Its
                                                                                    purpose is to typically indicate the
                                                                                    first byte of a package or to mark an
                                                                                    address byte, for example in a
                                                                                    multi-drop RS-485 network.  When bits
                                                                                    PEN, EPS, and SPS of UARTLCRH are
                                                                                    set, the parity bit is transmitted
                                                                                    and checked as a 0.  When bits PEN
                                                                                    and SPS are set and EPS is cleared,
                                                                                    the parity bit is transmitted and
                                                                                    checked as a 1. */
#define UNICOMMUART_LCRH_SPS_DISABLE             ((uint32_t)0x00000000U)         /* !< Disable Stick Parity */
#define UNICOMMUART_LCRH_SPS_ENABLE              ((uint32_t)0x00000040U)         /* !< Enable Stick Parity */
/* UNICOMMUART_LCRH[SENDIDLE] Bits */
#define UNICOMMUART_LCRH_SENDIDLE_OFS            (7)                             /* !< SENDIDLE Offset */
#define UNICOMMUART_LCRH_SENDIDLE_MASK           ((uint32_t)0x00000080U)         /* !< UART send IDLE pattern. When this
                                                                                    bit is set,  SENDIDLE period of 11
                                                                                    bit times will be sent on the TX
                                                                                    line.   Read STAT.SENDIDLE bit to
                                                                                    readback current status of SENDIDLE */
#define UNICOMMUART_LCRH_SENDIDLE_DISABLE        ((uint32_t)0x00000000U)         /* !< Normal operation */
#define UNICOMMUART_LCRH_SENDIDLE_ENABLE         ((uint32_t)0x00000080U)         /* !< Send Idle Pattern */
/* UNICOMMUART_LCRH[EXTDIR_SETUP] Bits */
#define UNICOMMUART_LCRH_EXTDIR_SETUP_OFS        (16)                            /* !< EXTDIR_SETUP Offset */
#define UNICOMMUART_LCRH_EXTDIR_SETUP_MASK       ((uint32_t)0x001F0000U)         /* !< Defines the number of UARTclk ticks
                                                                                    the signal to control the external
                                                                                    driver for the RS485 will be set
                                                                                    before the START bit is send */
#define UNICOMMUART_LCRH_EXTDIR_SETUP_MINIMUM    ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMUART_LCRH_EXTDIR_SETUP_MAXIMUM    ((uint32_t)0x001F0000U)         /* !< Highest possible value */
/* UNICOMMUART_LCRH[EXTDIR_HOLD] Bits */
#define UNICOMMUART_LCRH_EXTDIR_HOLD_OFS         (21)                            /* !< EXTDIR_HOLD Offset */
#define UNICOMMUART_LCRH_EXTDIR_HOLD_MASK        ((uint32_t)0x03E00000U)         /* !< Defines the number of UARTclk ticks
                                                                                    the signal to control the external
                                                                                    driver for the RS485 will be reset
                                                                                    after the beginning of the stop bit.
                                                                                    (If 2 STOP bits are enabled the
                                                                                    beginning of the 2nd STOP bit.) */
#define UNICOMMUART_LCRH_EXTDIR_HOLD_MINIMUM     ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMUART_LCRH_EXTDIR_HOLD_MAXIMUM     ((uint32_t)0x03E00000U)         /* !< Highest possible value */
/* UNICOMMUART_LCRH[SUSPEND] Bits */
#define UNICOMMUART_LCRH_SUSPEND_OFS             (26)                            /* !< SUSPEND Offset */
#define UNICOMMUART_LCRH_SUSPEND_MASK            ((uint32_t)0x04000000U)         /* !< Suspend external communication */
#define UNICOMMUART_LCRH_SUSPEND_DISABLE         ((uint32_t)0x00000000U)         /* !< Functional mode resumed */
#define UNICOMMUART_LCRH_SUSPEND_ENABLE          ((uint32_t)0x04000000U)         /* !< External communication suspended */

